tube/tube_r0.75mm_l15cm_15mlpmin_11cells_snappy/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Dimensions means physical dimensions with respect to the SI unit system
// Number is exponent
//      SI [  kg   m   s   K mol   A  cd]
dimensions [   0   2  -2   0   0   0   0];  // rho-normalized pressure
// To get true pressure, multiply by the density of fluid

internalField uniform 0;

boundaryField
{
    outlet
    {
        type fixedValue;
        value uniform 0;
    }

    inlet
    {
        type zeroGradient;
    }

    tubePatch
    {
        type zeroGradient;
    }
}
