tube/tube_r0.75mm_l15cm_15mlpmin_11cells_snappy/Allrun
#!/bin/sh

cd ${0%/*} || exit 1  # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions  # Tutorial run functions

./ConstructMesh
./RunSimulation

